{"categories":[{"category":"Frontend Frameworks","content":"<p>Frameworks and UI libraries for building user interfaces in the browser.</p>\n","subcategories":[{"subcategory":"Frameworks","content":"<ul>\n<li><strong>Vue.js</strong>: A progressive JavaScript framework for building dynamic user interfaces.</li>\n<li><strong>Angular</strong>: A comprehensive framework for building large-scale web applications with a focus on TypeScript.</li>\n<li><strong>Svelte</strong>: A compiler for writing reactive and efficient user interfaces with minimal boilerplate.</li>\n<li><strong>Aurelia</strong>: A modern, open-source framework for building modular and scalable applications.</li>\n<li><strong>Cycle.js</strong>: A functional and reactive framework inspired by functional reactive programming (FRP).</li>\n<li><strong>Dojo Toolkit</strong>: A comprehensive JavaScript toolkit for enterprise-level web development.</li>\n<li><strong>Dojo</strong>: A progressive framework for building modern web applications with a focus on performance.</li>\n<li><strong>Flight.js</strong>: A lightweight framework for adding modular and event-driven components to HTML.</li>\n<li><strong>GWT</strong>: A toolkit for developing complex browser-based applications in Java.</li>\n<li><strong>Qwik</strong>: A high-performance framework for building fast and scalable web applications.</li>\n<li><strong>Ext JS</strong>: A framework for building data-intensive web and mobile applications with rich UI components.</li>\n<li><strong>Stimulus</strong>: A minimal JavaScript framework for augmenting HTML with predictable, unobtrusive behavior.</li>\n<li><strong>Webix</strong>: A UI framework for building cross-platform applications with over 80 ready-to-use UI components.</li>\n</ul>\n"},{"subcategory":"UI Libraries","content":"<ul>\n<li><strong>React</strong>: A JavaScript library for building user interfaces, maintained by Meta (Facebook).</li>\n<li><strong>Alpine</strong>: A lightweight library for composing JavaScript behavior directly in your HTML templates.</li>\n<li><strong>Dropzone</strong>: A drag-and-drop file upload library with customizable drop zones.</li>\n<li><strong>Glimmer</strong>: A fast and lightweight UI component library optimized for rendering complex data-driven applications.</li>\n<li><strong>htmx</strong>: A library for building dynamic HTML-based web applications with minimal JavaScript.</li>\n<li><strong>jQuery Mobile</strong>: A touch-friendly framework for building responsive mobile web applications.</li>\n<li><strong>jQuery</strong>: A foundational JavaScript library for simplifying DOM manipulation and AJAX requests.</li>\n<li><strong>Knockout</strong>: A library for creating dynamic and responsive user interfaces with a clean MVVM architecture.</li>\n<li><strong>Stencil JS</strong>: A compiler for building reusable and high-performance Web Components.</li>\n</ul>\n"}]},{"category":"Backend Frameworks","content":"<p>Frameworks for building server-side applications and APIs.</p>\n","subcategories":[{"subcategory":"Frameworks","content":"<ul>\n<li><strong>Express.js</strong>: A minimal and flexible Node.js framework for building web and API applications.</li>\n<li><strong>Hono</strong>: A lightweight framework optimized for edge runtime environments and serverless functions.</li>\n<li><strong>Koa</strong>: A next-generation web framework for Node.js.</li>\n<li><strong>NestJS</strong>: A progressive Node.js framework for building efficient, reliable and scalable server-side applications.</li>\n<li><strong>Fastify</strong>: Fast and low overhead web framework, for Node.js.</li>\n<li><strong>Adonis</strong>: AdonisJS is a TypeScript-first web framework for building web apps and API servers.</li>\n<li><strong>Hapi</strong>: Build powerful, scalable applications, with minimal overhead and full out-of-the-box functionality.</li>\n</ul>\n"}]},{"category":"Build Tools","content":"<p>Tools for building, bundling, and optimizing JavaScript and TypeScript projects.</p>\n","subcategories":[{"subcategory":"Bundlers","content":"<ul>\n<li><strong>Vite</strong>: A fast development server and build tool for modern JavaScript/TypeScript projects.</li>\n<li><strong>esbuild</strong>: An extremely fast JavaScript bundler and minifier written in Go.</li>\n<li><strong>Parcel</strong>: A zero-configuration build tool for the modern web.</li>\n<li><strong>Webpack</strong>: A powerful module bundler for managing complex JavaScript applications.</li>\n<li><strong>Rollup</strong>: A modular bundler for JavaScript with a focus on tree-shaking and ES module support.</li>\n<li><strong>Snowpack</strong>: The faster frontend build tool.</li>\n<li><strong>Speedy Web Compiler</strong>: SWC is an extensible Rust-based platform for the next generation of fast developer tools.</li>\n</ul>\n"}]},{"category":"Mobile Frameworks","content":"<p>Frameworks for building mobile applications using JavaScript and TypeScript.</p>\n","subcategories":[{"subcategory":"Frameworks","content":"<ul>\n<li><strong>React Native</strong>: A framework for building native mobile apps using React and JavaScript.</li>\n<li><strong>Capacitor.js</strong>: A cross-platform runtime for building native apps with web technologies.</li>\n<li><strong>Cordova</strong>: A hybrid mobile app development framework powered by Apache.</li>\n</ul>\n"}]},{"category":"Full-stack Frameworks","content":"<p>Frameworks that support both frontend and backend development.</p>\n","subcategories":[{"subcategory":"Frameworks","content":"<ul>\n<li><strong>Next.js</strong>: A React framework for server-side rendering and static site generation.</li>\n<li><strong>Gatsby</strong>: A static site generator optimized for performance and SEO.</li>\n<li><strong>Fresh</strong>: A Deno-based framework for building fast and secure web applications.</li>\n<li><strong>Derby</strong>: A full-stack MVC framework for real-time collaborative applications.</li>\n<li><strong>T3</strong>: A full-stack TypeScript framework for building production-ready Next.js applications.</li>\n<li><strong>SvelteKit</strong>: A framework for building fast and modern web applications using Svelte.</li>\n</ul>\n"}]},{"category":"Languages","content":"<p>Languages that compile to or extend JavaScript.</p>\n","subcategories":[{"subcategory":"Languages","content":"<ul>\n<li><strong>ClojureScript</strong>: A compiler that translates Clojure code to JavaScript for browser or Node.js environments.</li>\n<li><strong>CoffeeScript</strong>: A concise and expressive language that compiles to JavaScript.</li>\n<li><strong>PureScript</strong>: A strongly typed functional programming language that compiles to JavaScript.</li>\n<li><strong>ReScript</strong>: A statically typed language that compiles to idiomatic and efficient JavaScript.</li>\n<li><strong>WebAssembly</strong>: A low-level binary format for executing high-performance code in web browsers.</li>\n</ul>\n"}]},{"category":"Libraries","content":"<p>General-purpose JavaScript libraries.</p>\n","subcategories":[{"subcategory":"Libraries","content":"<ul>\n<li><strong>Axios</strong>: A promise-based HTTP client for making asynchronous requests in browsers and Node.js.</li>\n<li><strong>Chart.js</strong>: A simple and flexible library for creating responsive and animated charts.</li>\n<li><strong>D3.js</strong>: A powerful library for creating dynamic and interactive data visualizations.</li>\n<li><strong>Effector</strong>: A state management library focused on functional reactive programming (FRP).</li>\n<li><strong>Greensock</strong>: A high-performance animation library for creating smooth and complex animations.</li>\n<li><strong>Highcharts</strong>: A feature-rich library for creating interactive and customizable charts.</li>\n<li><strong>p5.js</strong>: A JavaScript library for creative coding and visual arts.</li>\n<li><strong>Ramda</strong>: A functional programming library providing utility functions for immutable data manipulation.</li>\n<li><strong>stdlib</strong>: A comprehensive standard library for numerical and scientific computing in JavaScript.</li>\n<li><strong>Stylis</strong>: A fast CSS preprocessor with support for nesting, variables, and custom functions.</li>\n<li><strong>Three.js</strong>: A cross-browser library for creating 3D graphics in the browser using WebGL.</li>\n<li><strong>UnJS</strong>: A collection of utilities and libraries for building modern web applications.</li>\n<li><strong>Knockout</strong>: A library for creating dynamic and responsive user interfaces with a clean MVVM architecture.</li>\n<li><strong>jQuery</strong>: A foundational JavaScript library for simplifying DOM manipulation and AJAX requests.</li>\n<li><strong>jQuery Mobile</strong>: A touch-friendly framework for building responsive mobile web applications.</li>\n<li><strong>Stencil JS</strong>: A compiler for building reusable and high-performance Web Components.</li>\n<li><strong>Lexical</strong>: A framework for building rich text editors with a focus on extensibility and performance.</li>\n<li><strong>Leaflet</strong>: A lightweight library for creating interactive maps with markers, popups, and tile layers.</li>\n<li><strong>OpenLayers</strong>: A high-performance library for rendering vector and raster maps with advanced features.</li>\n<li><strong>jsDelivr</strong>: A free CDN for open source projects.</li>\n</ul>\n"},{"subcategory":"State Management","content":"<ul>\n<li><strong>Immer</strong>: A library for producing immutable updates to state using &quot;mutating&quot; syntax.</li>\n<li><strong>Immutable.js</strong>: A library for working with immutable collections and data structures in JavaScript.</li>\n<li><strong>Microcosm</strong>: A state management library for creating composable and predictable application states.</li>\n<li><strong>MobX</strong>: A simple and scalable state management library with reactive data binding.</li>\n<li><strong>Redux</strong>: A predictable state container for JavaScript applications with a time-travel debugger.</li>\n<li><strong>Fluxxor</strong>: Tools for implementing the Flux architecture in JavaScript applications.</li>\n<li><strong>Zustand</strong>: A small, fast and scalable bearbones state-management solution using simplified flux principles.</li>\n<li><strong>Recoil</strong>: A state management library for React applications.</li>\n</ul>\n"},{"subcategory":"Query Builder","content":"<ul>\n<li><strong>Knex.js</strong>: A SQL query builder that supports multiple databases and transactions.</li>\n</ul>\n"},{"subcategory":"Mapping","content":"<ul>\n<li><strong>Leaflet</strong>: A lightweight library for creating interactive maps with markers, popups, and tile layers.</li>\n<li><strong>OpenLayers</strong>: A high-performance library for rendering vector and raster maps with advanced features.</li>\n</ul>\n"},{"subcategory":"Text Editor","content":"<ul>\n<li><strong>Lexical</strong>: A framework for building rich text editors with a focus on extensibility and performance.</li>\n</ul>\n"},{"subcategory":"Testing","content":"<ul>\n<li><strong>Cypress</strong>: With Cypress, you can easily create tests for your modern web applications, debug them visually, and automatically run them in your continuous integration builds.</li>\n<li><strong>Jest</strong>: Jest is a delightful JavaScript Testing Framework with a focus on simplicity.</li>\n<li><strong>Mocha</strong>: Mocha is a feature-rich JavaScript test framework running on Node.js and in the browser, making asynchronous testing simple and fun.</li>\n<li><strong>Playwright</strong>: Playwright Test was created specifically to accommodate the needs of end-to-end testing.</li>\n<li><strong>Vitest</strong>: ViteTest is a fast and lightweight testing framework designed to work seamlessly with Vite projects.</li>\n</ul>\n"}]},{"category":"Web3","content":"<p>Libraries for blockchain and decentralized application development.</p>\n","subcategories":[{"subcategory":"Libraries","content":"<ul>\n<li><strong>Ethers.js</strong>: A comprehensive library for interacting with Ethereum blockchain and smart contracts.</li>\n</ul>\n"}]},{"category":"ORM","content":"<p>Object-Relational Mapping libraries for JavaScript and TypeScript.</p>\n","subcategories":[{"subcategory":"ORM","content":"<ul>\n<li><strong>Drizzle</strong>: A TypeScript-first ORM designed for writing database queries in a SQL-like syntax.</li>\n<li><strong>Prisma</strong>: A modern ORM for Node.js and TypeScript that simplifies database access and management.</li>\n<li><strong>TypeORM</strong>: TypeORM is an ORM that can run in NodeJS, Browser, Cordova, PhoneGap, Ionic, React Native, NativeScript, Expo, and Electron platforms and can be used with TypeScript and JavaScript (ES2021).</li>\n<li><strong>Sequelize</strong>: Sequelize is a modern TypeScript and Node.js ORM for Oracle, Postgres, MySQL, MariaDB, SQLite and SQL Server, and more.</li>\n</ul>\n"}]},{"category":"Tooling","content":"<p>Tools for documentation, type checking, package management, formatting, linting, API gateway, and module loading in JavaScript and TypeScript projects.</p>\n","subcategories":[{"subcategory":"Documentation","content":"<ul>\n<li><strong>ESDoc</strong>: A documentation generator that produces JSDoc-style documentation for JavaScript projects.</li>\n</ul>\n"},{"subcategory":"Type Checkers","content":"<ul>\n<li><strong>Flow</strong>: A static type checker that helps catch type errors in large JavaScript codebases.</li>\n</ul>\n"},{"subcategory":"Package Managers","content":"<ul>\n<li><strong>npm</strong>: The default package manager for Node.js with a vast ecosystem of open-source packages.</li>\n<li><strong>Yarn</strong>: Yarn is a package manager that doubles down as project manager.</li>\n<li><strong>pnpm</strong>: A fast, disk space-efficient package manager that uses symlinks to save space.</li>\n</ul>\n"},{"subcategory":"Formatters and Linters","content":"<ul>\n<li><strong>Prettier</strong>: A code formatter that enforces consistent style across all files in a project.</li>\n<li><strong>ESLint</strong>: A tool for identifying and reporting on problematic patterns in JavaScript code.</li>\n<li><strong>Stylelint</strong>: A mighty CSS linter that helps you avoid errors and enforce conventions.</li>\n</ul>\n"},{"subcategory":"API Gateway","content":"<ul>\n<li><strong>Kong</strong>: A cloud-native API gateway for managing and securing microservices.</li>\n</ul>\n"},{"subcategory":"Module Loaders","content":"<ul>\n<li><strong>RequireJS</strong>: A module loader that simplifies the management of JavaScript dependencies.</li>\n</ul>\n"}]},{"category":"Engines and Runtimes","content":"<p>JavaScript engines and runtimes for executing JavaScript code.</p>\n","subcategories":[{"subcategory":"JavaScript Engines","content":"<ul>\n<li><strong>SpiderMonkey</strong>: The first JavaScript engine, developed by Mozilla for Firefox and other applications.</li>\n<li><strong>V8 Engine</strong>: A high-performance open-source JavaScript and WebAssembly engine used in Chrome and Node.js.</li>\n<li><strong>JavaScript Core</strong>: Apple's JavaScript engine for Safari and other macOS/iOS applications.</li>\n</ul>\n"},{"subcategory":"Runtimes","content":"<ul>\n<li><strong>Node.js</strong>: A JavaScript runtime built on Chrome's V8 engine for server-side and command-line applications.</li>\n<li><strong>Bun</strong>: A fast and modern JavaScript runtime with built-in bundling and type-checking tools.</li>\n<li><strong>Deno</strong>: A secure and modern runtime for JavaScript and TypeScript with first-class module support.</li>\n</ul>\n"}]}]}